int/resources/objectRepo/xmlTemplates/htng/HTNG2008BProfile/req_FetchProfile.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://htng.org/PWS/2008B/SingleGuestItinerary/Name/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:FetchProfileRequest>
         <typ:ProfileID source="?"></typ:ProfileID>
         <typ:ResortId></typ:ResortId>
      </typ:FetchProfileRequest>
   </soapenv:Body>
</soapenv:Envelope>
